app/controllers/books_controller.rb

INSERT INTO "books" ("title", "body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "aaaaa"], ["body", "aaaaaaaa"], ["created_at", "2019-08-25 05:04:47.412572"], ["updated_at", "2019-08-25 05:04:47.412572"], ["user_id", 3]]
SELECT "books".* FROM "books"
---
  def create
  	@book = Book.new(book_params)
    @book.user_id = current_user.id
  	if @book.save
       flash[:notice] = "You have creatad book successfully."
  	   redirect_to("/books/#{@book.id}")
    else
      @books = Book.all

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
     def correct_book
      @book = Book.find(params[:id])